{
    "name": "Format\\AdvertisingSettings",
    "description": "The object for defining properties that affect the frequency and placement with which banner advertisements and medium rectangle advertisements are automatically placed in your article.",
    "version": "1.7+",
    "deprecated": true,
    "from_class": null,
    "extends": null,
    "typed": null,
    "url": "https:\/\/developer.apple.com\/tutorials\/data\/documentation\/apple_news\/advertisingsettings.json",
    "properties": [
        {
            "name": "bannerType",
            "type": "enum:string",
            "required": false,
            "description": "The banner type that should be shown. ",
            "default": "any",
            "enum_values": [
                "any",
                "standard",
                "double_height",
                "large"
            ],
            "typed": false
        },
        {
            "name": "distanceFromMedia",
            "type": [
                "SupportedUnits",
                "integer"
            ],
            "required": false,
            "description": "Either a number in points or a string referring to a supported unit of measure that describes the minimum required distance between automatically inserted advertisement components and media, such as video, images, and embeds.\nFor example, you can enter a value such as 10vh to keep automatically inserted advertisements at 50% of the viewport height from your media content.\nVersion 1.1",
            "default": "0",
            "typed": false
        },
        {
            "name": "frequency",
            "type": "integer",
            "required": false,
            "description": "A number between  and 10 defining the frequency for automatically inserting advertising components into articles.\nSetting this value to 1 will automatically insert a banner advertisement in the first possible location below the screen bounds. Setting this value to 2 inserts a banner advertisement in the first possible location below the screen bounds, and a second banner advertisement is inserted between the first banner advertisement and the end of the article. Increasing the frequency increases the frequency of banner advertisements below the first screen bounds.\nTo increase the likelihood of a banner advertisement getting inserted on every screen, set the frequency to 10. To achieve the likelihood of every other screen, set the frequency to 5.\nLeaving this property out, or providing a value of  means that no advertisement will be inserted.",
            "default": "0",
            "maximum": "10",
            "minimum": "0",
            "typed": false
        },
        {
            "name": "layout",
            "type": "Format\\AdvertisingLayout",
            "required": false,
            "description": "Layout object that currently supports margin only. An automatically inserted advertising component uses the surrounding margins to make sure it positions itself nicely in between components. If needed, the margins that will be created around these advertisements can be defined using this layout property.",
            "typed": false
        }
    ]
}