{
    "name": "Format\\AdvertisementAutoPlacement",
    "description": "The object for defining the automatic placement of advertisements.",
    "version": "1.9+",
    "deprecated": true,
    "from_class": null,
    "extends": "Format\\AutoPlacement",
    "typed": null,
    "url": "https:\/\/developer.apple.com\/tutorials\/data\/documentation\/apple_news\/advertisementautoplacement.json",
    "properties": [
        {
            "name": "bannerType",
            "type": "enum:string",
            "required": false,
            "description": "A specific banner type that should be automatically inserted based on the frequency value. If advertisement placement is enabled, only banners of the defined size type are inserted.",
            "default": "any",
            "enum_values": [
                "any",
                "standard",
                "double_height",
                "large"
            ],
            "typed": false
        },
        {
            "name": "conditional",
            "type": [
                "Format\\ConditionalAutoPlacement",
                "array:Format\\ConditionalAutoPlacement"
            ],
            "required": false,
            "description": "An instance or array of automatic placement properties that can be applied conditionally, and the conditions that cause them to take effect.",
            "typed": false
        },
        {
            "name": "distanceFromMedia",
            "type": [
                "SupportedUnits",
                "number"
            ],
            "required": false,
            "description": "The minimum required distance between automatically inserted advertisement components and media, such as  and . Advertisements will show next to media if distanceFromMedia is not specified. To maintain a minimum distance of half a screen height from your media content, use a value of around 10vh. For more information, see .",
            "default": "0",
            "typed": false
        },
        {
            "name": "enabled",
            "type": "boolean",
            "required": false,
            "description": "A Boolean that defines whether placement of advertisements is enabled. ",
            "default": true,
            "typed": false
        },
        {
            "name": "frequency",
            "type": "integer",
            "required": false,
            "description": "A number from  to 10, defining the frequency for automatically inserting ads into articles.\nSetting this value to 1 automatically inserts a dynamic advertisement in the first possible location below the screen bounds. \nSetting this value to 2 inserts a dynamic advertisement in the first possible location below the screen bounds, and another between the first dynamic advertisement and the end of the article. \nIncreasing the frequency value increases the frequency of dynamic advertisements below the first screen bounds.\nSetting this value to 0, or omitting it, results in no advertisements.",
            "default": "0",
            "maximum": "10",
            "minimum": "0",
            "typed": false
        },
        {
            "name": "layout",
            "type": "Format\\AutoPlacementLayout",
            "required": false,
            "description": "The layout properties for automatically inserted components.",
            "typed": false
        }
    ]
}