{
    "name": "Format\\ArticleDocument",
    "description": "The root object of an Apple News article, that contains required properties, metadata, content, layout, and styles.",
    "version": "1.7+",
    "deprecated": false,
    "from_class": null,
    "extends": null,
    "typed": null,
    "url": "https:\/\/developer.apple.com\/tutorials\/data\/documentation\/apple_news\/articledocument.json",
    "properties": [
        {
            "name": "components",
            "type": "array:Format\\Component",
            "required": true,
            "description": "An array of components that form the content of this article. Components have different roles and types, such as  and .",
            "typed": true
        },
        {
            "name": "componentTextStyles",
            "type": "Format\\ComponentTextStyles",
            "required": true,
            "description": "The component text styles that can be referred to by components in this document. Each article.json file must have, at minimum, a default component text style named default. Defaults by component role can also be set. See .",
            "typed": false
        },
        {
            "name": "identifier",
            "type": "string",
            "required": true,
            "description": "A unique, publisher-provided identifier for this article. This identifier must remain constant; it cannot change when the article is updated. See .\nThis identifier can include the following:",
            "typed": false
        },
        {
            "name": "language",
            "type": "string",
            "required": true,
            "description": "A code that indicates the language of the article. Use the  to find the appropriate code; e.g., en for English, or the more specific en-GB for English (U.K.) or en-US for English (U.S.).",
            "typed": false
        },
        {
            "name": "layout",
            "type": "Format\\Layout",
            "required": true,
            "description": "The article’s column system. Apple News Format layouts make it possible to recreate print design on iPhone, iPad, iPod touch and Mac. Layout information is also used to calculate relative positioning and size for these devices. See .",
            "typed": false
        },
        {
            "name": "title",
            "type": "string",
            "required": true,
            "description": "The article title or headline. Should be plain text; formatted text (HTML or Markdown) is not supported.",
            "typed": false
        },
        {
            "name": "version",
            "type": "string",
            "required": true,
            "description": "The version of Apple News Format used in the JSON document. \nThe value of the version property must not be earlier than the version number of any property that is used anywhere in the article. \nSee .",
            "typed": false
        },
        {
            "name": "advertisingSettings",
            "type": "Format\\AdvertisingSettings",
            "required": false,
            "description": "An advertisement to be inserted at a position that is both possible and optimal. You can specify what bannerType you want to have automatically inserted. \nNote. This property is deprecated. Use the  object instead.",
            "typed": false
        },
        {
            "name": "autoplacement",
            "type": "Format\\AutoPlacement",
            "required": false,
            "description": "The metadata, appearance, and placement of advertising and related content components within Apple News Format articles.",
            "typed": false
        },
        {
            "name": "colorScheme",
            "type": "Format\\ColorScheme",
            "required": false,
            "description": "The colorScheme object that you use for automatic Dark Mode behavior.",
            "typed": false
        },
        {
            "name": "componentLayouts",
            "type": "Format\\ComponentLayouts",
            "required": false,
            "description": "The article-level ComponentLayout objects that can be referred to by their key within the ComponentLayouts object. See .",
            "typed": false
        },
        {
            "name": "componentStyles",
            "type": "Format\\ComponentStyles",
            "required": false,
            "description": "The component styles that can be referred to by components within this document. See .",
            "typed": false
        },
        {
            "name": "documentStyle",
            "type": "Format\\DocumentStyle",
            "required": false,
            "description": "An object containing the background color of the article.",
            "typed": false
        },
        {
            "name": "metadata",
            "type": "Format\\Metadata",
            "required": false,
            "description": "The article's metadata, such as publication date, ad campaign data, and other information that is not part of the core article content. ",
            "typed": false
        },
        {
            "name": "subtitle",
            "type": "string",
            "required": false,
            "description": "The article subtitle. Should be plain text; formatted text (HTML or Markdown) is not supported.",
            "typed": false
        },
        {
            "name": "textFormat",
            "type": "enum:string",
            "required": false,
            "description": "The global text format to apply to  components and  objects.\nIf the textFormat property is not specified, the format of Text components and formattedText objects defaults to none. \nIf the textFormat property is specified, the format of Text components and formattedText objects defaults to the value of this property. \nTo override the textFormat value, use the format property in the Text component or the formattedText object.",
            "enum_values": [
                "markdown",
                "html",
                "none"
            ],
            "typed": false
        },
        {
            "name": "textStyles",
            "type": "Format\\TextStyles",
            "required": false,
            "description": "The TextStyle objects available to use inline for text in Text components. See , , and .",
            "typed": false
        }
    ]
}