{
    "name": "Format\\EmbedWebVideo",
    "description": "The component for adding a web video from Dailymotion, Vimeo, or YouTube.",
    "version": "1.7+",
    "deprecated": false,
    "from_class": null,
    "extends": "Format\\Component",
    "typed": null,
    "url": "https:\/\/developer.apple.com\/tutorials\/data\/documentation\/apple_news\/embedwebvideo.json",
    "properties": [
        {
            "name": "role",
            "type": "enum:string",
            "required": true,
            "description": "Always embedwebvideo or embedvideo for this component.",
            "value": "embedwebvideo",
            "read_only": true,
            "enum_values": [
                "embedwebvideo",
                "embedvideo"
            ],
            "typed": false
        },
        {
            "name": "URL",
            "type": "uri",
            "required": true,
            "description": "The URL of the embeddable video to display (the Dailymotion, Vimeo, or YouTube embed link). The embed URL is usually different from the standard video URL.\nA Dailymotion embed URL typically looks like this: https:\/\/geo.dailymotion.com\/player.html?video=x84sh87\nA Vimeo embed URL typically looks like this: https:\/\/player.vimeo.com\/video\/121450839\nA YouTube embed URL typically looks like this: https:\/\/www.youtube.com\/embed\/0qwALOOvUik",
            "typed": false
        },
        {
            "name": "accessibilityCaption",
            "type": "string",
            "required": false,
            "description": "A caption that describes the content of the embedded web video. The text is used for VoiceOver. For more information about VoiceOver, see the  page in Accessibility. If accessibilityCaption is not provided, the caption value is used for VoiceOver for iOS, VoiceOver for iPadOS, and VoiceOver for macOS. ",
            "typed": false
        },
        {
            "name": "anchor",
            "type": "Format\\Anchor",
            "required": false,
            "description": "An object that defines vertical alignment with another component.",
            "typed": false
        },
        {
            "name": "animation",
            "type": [
                "Format\\ComponentAnimation",
                "none"
            ],
            "required": false,
            "description": "An object that defines an animation to be applied to the component.\nThe none value is used for conditional design elements. Adding it here has no effect.",
            "typed": true
        },
        {
            "name": "aspectRatio",
            "type": "number",
            "required": false,
            "description": "The aspect ratio of the video: width divided by height. The aspect ratio determines the height of the video player.\nWhen this property is omitted, the video player will have a 16:9 aspect ratio (1.777), and videos with ratios other than 16:9 will automatically be letterboxed.",
            "default": "1.777",
            "typed": false
        },
        {
            "name": "behavior",
            "type": [
                "Format\\Behavior",
                "none"
            ],
            "required": false,
            "description": "An object that defines behavior for a component, like  or .\nThe none value is used for conditional design elements. Adding it here has no effect.",
            "typed": true
        },
        {
            "name": "caption",
            "type": "string",
            "required": false,
            "description": "A caption that describes the content of the embedded web video. This text is used by VoiceOver if accessibilityCaption is not provided, or it can be shown when the embedded web video cannot be played.  For more information about VoiceOver, see the  page in Accessibility. ",
            "typed": false
        },
        {
            "name": "conditional",
            "type": [
                "Format\\ConditionalComponent",
                "array:Format\\ConditionalComponent"
            ],
            "required": false,
            "description": "An instance or array of component properties that can be applied conditionally, and the conditions that cause them to be applied.",
            "typed": false
        },
        {
            "name": "explicitContent",
            "type": "boolean",
            "required": false,
            "description": "A Boolean value that indicates that the embedded web video may contain explicit content.",
            "typed": false
        },
        {
            "name": "hidden",
            "type": "boolean",
            "required": false,
            "description": "A Boolean value that determines whether the component is hidden.",
            "default": true,
            "typed": false
        },
        {
            "name": "identifier",
            "type": "string",
            "required": false,
            "description": "An optional unique identifier for this component. If used, this identifier must be unique across the entire document. You will need an identifier for your component if you want to anchor other components to it. See .",
            "typed": false
        },
        {
            "name": "layout",
            "type": [
                "Format\\ComponentLayout",
                "string"
            ],
            "required": false,
            "description": "An inline ComponentLayout object that contains layout information, or a string reference to a ComponentLayout object that is defined at the top level of the document. \nIf layout is not defined, size and position are based on various factors, such as the device type, the length of the content, and the role of this component.",
            "typed": false
        },
        {
            "name": "style",
            "type": [
                "Format\\ComponentStyle",
                "string",
                "none"
            ],
            "required": false,
            "description": "An inline ComponentStyle object that defines the appearance of this component, or a string reference to a ComponentStyle object that is defined at the top level of the document.\nThe none value is used for conditional design elements. Adding it here has no effect.",
            "typed": false
        }
    ]
}