{
    "name": "Format\\TableColumnStyle",
    "description": "The object for applying styles to columns in a table.",
    "version": "1.7+",
    "deprecated": false,
    "from_class": null,
    "extends": null,
    "typed": null,
    "url": "https:\/\/developer.apple.com\/tutorials\/data\/documentation\/apple_news\/tablecolumnstyle.json",
    "properties": [
        {
            "name": "backgroundColor",
            "type": "Color",
            "required": false,
            "description": "The background color for the table column.\nIf this property is omitted, the background is transparent.\nThe cell background color is highest priority, followed by the column, and finally the row. All three colors are applied, meaning that non-opaque values can cause combined colors. For example, using a red row together with a blue column, both with 50% opacity, creates a purple cell.",
            "typed": false
        },
        {
            "name": "conditional",
            "type": "array:Format\\ConditionalTableColumnStyle",
            "required": false,
            "description": "An array of styles to be applied only to columns that meet specified conditions. This can be used to create a table with alternating column background colors.",
            "typed": false
        },
        {
            "name": "divider",
            "type": "Format\\TableStrokeStyle",
            "required": false,
            "description": "The stroke style for the divider lines between columns.",
            "typed": false
        },
        {
            "name": "minimumWidth",
            "type": [
                "SupportedUnits",
                "number"
            ],
            "required": false,
            "description": "The minimum width of the columns, as a number in points or using the available units of measure for components. See .",
            "typed": false
        },
        {
            "name": "width",
            "type": "integer",
            "required": false,
            "description": "The relative column width. This value influences the distribution of column width but does not dictate any exact values. To set an exact minimum width, use minimumWidth instead.\nIt might be useful to think of the value of width as a percentage of the component’s width. For example, if you know that one column’s width should be about half that of the whole component, and another should be about a quarter of the component width, use values of 50 and 25.",
            "typed": false
        }
    ]
}