{
    "name": "Format\\VideoFill",
    "description": "The object for adding a video background fill to a component.",
    "version": "1.7+",
    "deprecated": false,
    "from_class": null,
    "extends": "Format\\Fill",
    "typed": null,
    "url": "https:\/\/developer.apple.com\/tutorials\/data\/documentation\/apple_news\/videofill.json",
    "properties": [
        {
            "name": "stillURL",
            "type": "uri",
            "required": true,
            "description": "The URL of the image file to use as a still image when the video is not playing.\nImage URLs can begin with http:\/\/, https:\/\/, or bundle:\/\/. If the image URL begins with bundle:\/\/, the referenced image file must be in the same directory as the document.\nImage filenames should be properly encoded as URLs. \nSee . ",
            "typed": false
        },
        {
            "name": "URL",
            "type": "uri",
            "required": true,
            "description": "The URL of a video file that can be played using AV Player. HTTP Live Streaming (HLS) is highly recommended (.M3U8). For more information about HLS, see  .",
            "typed": false
        },
        {
            "name": "attachment",
            "type": "enum:string",
            "required": false,
            "description": "A string that indicates how the fill should behave when a user scrolls. \nValid values:",
            "default": "scroll",
            "enum_values": [
                "fixed",
                "scroll"
            ],
            "typed": false
        },
        {
            "name": "fillMode",
            "type": "enum:string",
            "required": false,
            "description": "Indicates how the video fill should be displayed. \nValid values:",
            "default": "cover",
            "enum_values": [
                "fit",
                "cover"
            ],
            "typed": false
        },
        {
            "name": "horizontalAlignment",
            "type": "enum:string",
            "required": false,
            "description": "Sets the horizontal alignment of the video fill within its component. \nValid values:\nYou can use fillMode with horizontalAlignment to achieve the effect you want. For example, set fillMode to fit and horizontalAlignment to left to fit the video based on its aspect ratio and also align the left edge of the fill with the left edge of the component. Or set fillMode to cover and horizontalAlignment to right to scale the video horizontally and also align the right edge of the fill with the right edge of the component.",
            "default": "center",
            "enum_values": [
                "left",
                "center",
                "right"
            ],
            "typed": false
        },
        {
            "name": "loop",
            "type": "boolean",
            "required": false,
            "description": "When true, it specifies that the video will start over again when it reaches the end. ",
            "default": true,
            "typed": false
        },
        {
            "name": "type",
            "type": "string",
            "required": true,
            "description": "Describes the type of fill. Must be video for a video fill.",
            "value": "video",
            "read_only": true,
            "typed": false
        },
        {
            "name": "verticalAlignment",
            "type": "enum:string",
            "required": false,
            "description": "Sets the vertical alignment of the video fill within its component. \nValid values:\nYou can use fillMode with verticalAlignment to achieve the effect you want. For example, set fillMode to fit and verticalAlignment to top to fit the video based on its aspect ratio and also align the top of the fill with the top edge of the component. Or set fillMode to cover and verticalAlignment to top to scale the video vertically and also align the top of the fill with the top edge of the component.",
            "default": "center",
            "enum_values": [
                "top",
                "center",
                "bottom"
            ],
            "typed": false
        }
    ]
}