{
    "name": "Api\\Objects\\UpdateArticleMetadataFields",
    "description": "See the metadata fields for the Update an Article request.",
    "version": "1.0.0+",
    "deprecated": false,
    "from_class": null,
    "extends": null,
    "typed": null,
    "url": "https:\/\/developer.apple.com\/tutorials\/data\/documentation\/apple_news\/update_article_metadata_fields.json",
    "properties": [
        {
            "name": "revision",
            "type": "string",
            "required": true,
            "description": "The current revision token for the article. The value of this field must match the latest revision from an earlier Create, Read, or Update Article call. This field prevents multiple users from updating an article simultaneously, which results in data loss.",
            "typed": false
        },
        {
            "name": "accessoryText",
            "type": "string",
            "required": false,
            "description": "The text to include below the article excerpt in the channel view, such as a byline or category label.",
            "default": "metadata.authors",
            "maximum": "100",
            "typed": false
        },
        {
            "name": "isCandidateToBeFeatured",
            "type": "boolean",
            "required": false,
            "description": "A Boolean that indicates whether this article should be considered for featuring in Apple News.",
            "default": true,
            "typed": false
        },
        {
            "name": "isHidden",
            "type": "boolean",
            "required": false,
            "description": "A Boolean that indicates whether the article should be temporarily hidden from display in the News feed. Note that a hidden article is accessible if you have a direct link to the article.",
            "default": true,
            "typed": false
        },
        {
            "name": "isPreview",
            "type": "boolean",
            "required": false,
            "description": "A Boolean that indicates whether this article should be public (live) or should be a preview that’s only visible to members of your channel. Set isPreview to false to publish the article immediately and make it visible to all News users. \nIf your channel hasn’t yet been approved to publish articles in Apple News Format, setting isPreview to false results in an ONLY_PREVIEW_ALLOWED error.  ",
            "default": true,
            "typed": false
        },
        {
            "name": "isSponsored",
            "type": "boolean",
            "required": false,
            "description": "A Boolean that indicates whether this article consists of sponsored content for promotional purposes. You must mark sponsored content as such; channels that don’t follow this policy may be suspended.\nWhen using isSponsored, if you don’t want the sponsored article to appear in your channel’s feed, set sections to [] (an empty array).",
            "default": true,
            "typed": false
        },
        {
            "name": "links",
            "type": "Api\\Objects\\ArticleLinksRequest",
            "required": false,
            "description": "The section links for the article.",
            "typed": false
        },
        {
            "name": "maturityRating",
            "type": "enum:string",
            "required": false,
            "description": "A string that indicates the viewing audience for the content. \nMATURE indicates explicit content that’s only appropriate for a specific audience.\nBy default, the article inherits the value you set for your channel in News Publisher.",
            "default": "null",
            "enum_values": [
                "KIDS",
                "MATURE",
                "GENERAL"
            ],
            "typed": false
        },
        {
            "name": "targetTerritoryCountryCodes",
            "type": "array:string",
            "required": false,
            "description": "The target country codes required for publishing the updated article. \nIf you don’t specify the targetTerritoryCountryCodes in , or in Update Article Metadata Fields, the updated article is visible in all of your channel's territories.\nIf you specify targetTerritoryCountryCodes in Create Article Metadata Fields and no targetTerritoryCountryCodes is specified in Update Article Metadata Fields, the article is visible in all the countries specified in Create Article Metadata Fields.\nIf you specify targetTerritoryCountryCodes in Create Article Metadata Fields, and a subset of country codes are specified in Update Article Metadata Fields, the article is visible only in the subset of countries specified in Update Article Metadata Fields.\nCountry codes must be in ISO 3166-1 alpha-2 code format; for example, AU for Australia. For a complete list of ISO country codes, see .\nIf you specify a country code that isn’t not defined in your channel's territories, the  ARTICLE_TERRITORY_NOT_ALLOWED error is generated by the server. If you specify an invalid country code, the server generates an INVALID_ARTICLE_TERRITORY error.",
            "typed": false
        },
        {
            "name": "links",
            "type": "Api\\Objects\\ArticleLinks"
        }
    ]
}